tutorials/FF/dambreak/of-swe/interFoam_solver/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "precice-config.xml";

participant interFoam_solver;

modules (FF);

interfaces
{
  Interface1
  {
    mesh              interFoam_solver-Mesh;
    patches           (leftWall_inlet);

    readData
    (
      Alpha
      Velocity
    );

    writeData
    (
    );
  };
};
